# Limpieza de datos

In [1]:
import pandas as pd

pd.set_option('display.max_columns', None)
pd.set_option('display.max_rows', None)

pd.set_option('display.max_seq_items', None)

import warnings
warnings.filterwarnings('ignore')

Se disponen de 7 archivos .csv, de los cuales se procede a su análisis y limpieza.

## Limpieza actor.csv

Se trabaja para dejar nombre completo, primera letra en mayúsculas.

In [2]:
actor = pd.read_csv(r"..\data\actor.csv")
actor.head(5)

   actor_id first_name     last_name          last_update
0         1   PENELOPE       GUINESS  2006-02-15 04:34:33
1         2       NICK      WAHLBERG  2006-02-15 04:34:33
2         3         ED         CHASE  2006-02-15 04:34:33
3         4   JENNIFER         DAVIS  2006-02-15 04:34:33
4         5     JOHNNY  LOLLOBRIGIDA  2006-02-15 04:34:33

In [3]:
actor.shape

(200, 4)

Principalmente la limpieza consistirá en homogeneizar los nombres y eliminar la columna "last update". Del mismo modo se crea la columna "full_name" ya que normalmente los actores se reconocen por su nombre completo, y además permitirá más adelante operaciones entre distintos df

In [4]:
#todos los nombres y apellidos la primera letra en mayúsculas
actor["first_name"] = actor["first_name"].str.capitalize()
actor["last_name"] = actor["last_name"].str.capitalize()

In [5]:
#Creación columna "full_name", con el nombre completo
actor["full_name"] = actor["first_name"] + " " + actor["last_name"]

In [6]:
#Elimino las columnas que no me interesan. Si quisiera buscar algo por sólo un apellido o nombre, lo hago en SQL.
actor = actor.drop(["first_name","last_name", "last_update"], axis=1)

In [7]:
actor.head(5)

   actor_id            full_name
0         1     Penelope Guiness
1         2        Nick Wahlberg
2         3             Ed Chase
3         4       Jennifer Davis
4         5  Johnny Lollobrigida

## Limpieza category.csv

Se elimina la columna "last_update"

In [8]:
category = pd.read_csv(r"..\data\category.csv")
category.head(5)

   category_id       name          last_update
0            1     Action  2006-02-15 04:46:27
1            2  Animation  2006-02-15 04:46:27
2            3   Children  2006-02-15 04:46:27
3            4   Classics  2006-02-15 04:46:27
4            5     Comedy  2006-02-15 04:46:27

In [9]:
category.shape

(16, 3)

In [10]:
category = category.drop("last_update", axis=1)

In [11]:
category.head(5)

   category_id       name
0            1     Action
1            2  Animation
2            3   Children
3            4   Classics
4            5     Comedy

## Limpieza film.csv

Se eliminan las columnas que no contienen información relevante, y se trabaja el nombre de la película.

In [12]:
film = pd.read_csv(r"..\data\film.csv")
film.head(3)

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,NaN,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,NaN,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15 05:03:42
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,NaN,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",2006-02-15 05:03:42

In [13]:
#Elimino las columnas que no me interesan.
film = film.drop("original_language_id", axis=1)
film = film.drop("last_update", axis=1)

In [14]:
#Homogeneizo los nombres de las películas.
film["title"] = film["title"].str.capitalize()

In [15]:
film.head(3)

,film_id,title,description,release_year,language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features
0,1,Academy dinosaur,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes"
1,2,Ace goldfinger,A Astounding Epistle of a Database Administrat...,2006,1,3,4.99,48,12.99,G,"Trailers,Deleted Scenes"
2,3,Adaptation holes,A Astounding Reflection of a Lumberjack And a ...,2006,1,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes"

## Limpieza inventory.csv

Se elimina la columna "last_update", innecesaria.

In [16]:
inventory = pd.read_csv(r"..\data\inventory.csv")
inventory.head(3)

   inventory_id  film_id  store_id          last_update
0             1        1         1  2006-02-15 05:09:17
1             2        1         1  2006-02-15 05:09:17
2             3        1         1  2006-02-15 05:09:17

In [17]:
inventory = inventory.drop("last_update", axis=1)

In [18]:
inventory.head(3)

   inventory_id  film_id  store_id
0             1        1         1
1             2        1         1
2             3        1         1

## Limpieza language.csv

Se elimina la columna "last_update", innecesaria.

In [19]:
language = pd.read_csv(r"..\data\language.csv")
language

   language_id      name          last_update
0            1   English  2006-02-15 05:02:19
1            2   Italian  2006-02-15 05:02:19
2            3  Japanese  2006-02-15 05:02:19
3            4  Mandarin  2006-02-15 05:02:19
4            5    French  2006-02-15 05:02:19
5            6    German  2006-02-15 05:02:19

In [20]:
language = language.drop("last_update", axis=1)

In [21]:
language.head(3)

   language_id      name
0            1   English
1            2   Italian
2            3  Japanese

## Limpieza old_HDD.csv

Se trabajan los nombres de actores y títulos de películas

In [22]:
hdd = pd.read_csv(r"..\data\old_HDD.csv")
hdd.head(5)

  first_name last_name                  title  release_year  category_id
0   PENELOPE   GUINESS       ACADEMY DINOSAUR          2006            6
1   PENELOPE   GUINESS   ANACONDA CONFESSIONS          2006            2
2   PENELOPE   GUINESS            ANGELS LIFE          2006           13
3   PENELOPE   GUINESS  BULWORTH COMMANDMENTS          2006           10
4   PENELOPE   GUINESS          CHEAPER CLYDE          2006           14

In [23]:
#Trabajo con los nombres para que sea más homogéneo.
hdd["first_name"] = hdd["first_name"].str.capitalize()
hdd["last_name"] = hdd["last_name"].str.capitalize()
hdd["title"] = hdd["title"].str.capitalize()

In [24]:
#Es erróneo que todas las películas fueran estrenadas en 2006, cuando además hay registros de alquileres en 2005.
hdd = hdd.drop("release_year", axis=1)

In [25]:
hdd.head(5)

  first_name last_name                  title  category_id
0   Penelope   Guiness       Academy dinosaur            6
1   Penelope   Guiness   Anaconda confessions            2
2   Penelope   Guiness            Angels life           13
3   Penelope   Guiness  Bulworth commandments           10
4   Penelope   Guiness          Cheaper clyde           14

## Limpieza rental.csv

Se realiza la separación por columnas para obtener fecha y hora.

In [26]:
rental = pd.read_csv(r"..\data\rental.csv")
rental.head(5)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

In [27]:
rental = rental.drop("last_update", axis=1)

In [28]:
type(["rental_date"])

list

In [29]:
type(rental.loc[0,"rental_date"])

str

In [30]:
# Convertir la columna "rental_date" a tipo datetime
rental['rental_date'] = pd.to_datetime(rental['rental_date'], format='%Y-%m-%d %H:%M:%S')

In [31]:
# Crear una nueva columna para la fecha
rental['rental_date_day'] = rental['rental_date'].dt.date

In [32]:
# Crear una nueva columna para la hora
rental['rental_date_hour'] = rental['rental_date'].dt.time

In [33]:
rental = rental.drop("rental_date", axis=1)

In [34]:
# Mismo procedimiento con return_date
rental['return_date'] = pd.to_datetime(rental['return_date'], format='%Y-%m-%d %H:%M:%S')

In [35]:
# Mismo procedimiento con return_date
rental['return_date'] = pd.to_datetime(rental['return_date'], format='%Y-%m-%d %H:%M:%S')
rental['return_date_day'] = rental['return_date'].dt.date
rental['return_date_hour'] = rental['return_date'].dt.time
rental = rental.drop("return_date", axis=1)

In [36]:
rental.head(5)

,rental_id,inventory_id,customer_id,staff_id,rental_date_day,rental_date_hour,return_date_day,return_date_hour
0,1,367,130,1,2005-05-24,22:53:30,2005-05-26,22:04:30
1,2,1525,459,1,2005-05-24,22:54:33,2005-05-28,19:40:33
2,3,1711,408,1,2005-05-24,23:03:39,2005-06-01,22:12:39
3,4,2452,333,2,2005-05-24,23:04:41,2005-06-03,01:43:41
4,5,2079,222,1,2005-05-24,23:05:21,2005-06-02,04:33:21

## Trabajo df old_HDD y relación con df actors y film

Puedo volcar datos del df old_HDD a los df actor y df film para ahorrarme esta tabla en SQL.

Por un lado, hago merge de los df old_HDD y actor mediante la columna "full_name", que he creado previamente en las dos. De este modo el df actors contendrá los "film_id".

Por otro lado, merge de df old_HDD y df film mediante "title". Así el df film se queda con la información de "category_id".

#### Unión df old_HDD y film

In [37]:
#Hago merge en los df film y hdd, en la columna title, para que film tenga las categorías de las pelis. Sobreescribo film.
film = pd.merge(film, hdd, on='title', how='inner')

In [38]:
film = film.drop(['first_name', 'last_name'], axis=1)

In [39]:
film.shape

(1000, 12)

In [40]:
film = film.dropna()

In [41]:
film = film.drop_duplicates()

In [42]:
film.shape

(614, 12)

In [43]:
film.head(5)

,film_id,title,description,release_year,language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,category_id
0,1,Academy dinosaur,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",6
4,2,Ace goldfinger,A Astounding Epistle of a Database Administrat...,2006,1,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",11
5,3,Adaptation holes,A Astounding Reflection of a Lumberjack And a ...,2006,1,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",6
8,6,Agent truman,A Intrepid Panorama of a Robot And a Boy who m...,2006,1,3,2.99,169,17.99,PG,Deleted Scenes,9
10,9,Alabama devil,A Thoughtful Panorama of a Database Administra...,2006,1,3,2.99,114,21.99,PG-13,"Trailers,Deleted Scenes",11

#### Unión df old_HDD y actors

In [44]:
#creo la columna "full_name" para poder hacer merge del df old_hdd y df actors por esa misma columna.
hdd['full_name'] = hdd['first_name'] + ' ' + hdd['last_name']

In [45]:
#Merge de df actor y df hdd para tener los actores según las películas. Es la relación m:n de SQL.
af_mn = pd.merge(actor, hdd, on='full_name', how='inner')
af_mn.head(5)

,actor_id,full_name,first_name,last_name,title,category_id
0,1,Penelope Guiness,Penelope,Guiness,Academy dinosaur,6
1,1,Penelope Guiness,Penelope,Guiness,Anaconda confessions,2
2,1,Penelope Guiness,Penelope,Guiness,Angels life,13
3,1,Penelope Guiness,Penelope,Guiness,Bulworth commandments,10
4,1,Penelope Guiness,Penelope,Guiness,Cheaper clyde,14

In [46]:
#Merge de df af_mn y df film para tener los actores según los id de las películas.
af_mn = pd.merge(af_mn, film, on='title', how='inner')

In [47]:
af_mn.head(5)

,actor_id,full_name,first_name,last_name,title,category_id_x,film_id,description,release_year,language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,category_id_y
0,1,Penelope Guiness,Penelope,Guiness,Academy dinosaur,6,1,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",6
1,10,Christian Gable,Christian,Gable,Academy dinosaur,6,1,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",6
2,20,Lucille Tracy,Lucille,Tracy,Academy dinosaur,6,1,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",6
3,30,Sandra Peck,Sandra,Peck,Academy dinosaur,6,1,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",6
4,1,Penelope Guiness,Penelope,Guiness,Anaconda confessions,2,23,A Lacklusture Display of a Dentist And a Denti...,2006,1,3,0.99,92,9.99,R,"Trailers,Deleted Scenes",2

In [48]:
af_mn.columns

Index(['actor_id', 'full_name', 'first_name', 'last_name', 'title',
       'category_id_x', 'film_id', 'description', 'release_year',
       'language_id', 'rental_duration', 'rental_rate', 'length',
       'replacement_cost', 'rating', 'special_features', 'category_id_y'],
      dtype='object')

In [49]:
af_mn = af_mn.drop(['full_name', 'first_name', 'last_name', 'title',
       'category_id_x', 'description', 'release_year',
       'language_id', 'rental_duration', 'rental_rate', 'length',
       'replacement_cost', 'rating', 'special_features', 'category_id_y'], axis=1)

In [50]:
#Elimino duplicados y reseteo índices
af_mn = af_mn.drop_duplicates()
af_mn = af_mn.reset_index(drop=True)

In [51]:
af_mn.shape

(1000, 2)

La tabla anterior me relaciona los actores y las películas. Es la relación m:n de SQL.

## Exportación .csv limpios

In [52]:
actor.to_csv('../data/actor_clean.csv', index=False)

In [53]:
category.to_csv('../data/category_clean.csv', index=False)

In [54]:
film.to_csv('../data/film_clean.csv', index=False)

In [55]:
inventory.to_csv('../data/inventory_clean.csv', index=False)

In [56]:
language.to_csv('../data/language_clean.csv', index=False)

In [57]:
rental.to_csv('../data/rental_clean.csv', index=False)

In [58]:
af_mn.to_csv('../data/af_mn.csv', index=False)